#include <stdio.h>

int main() {
    int n;

    // Մուտքագրել զանգվածների չափսը
    printf("Մուտքագրեք զանգվածների չափսը: ");
    scanf("%d", &n);

    // Ստեղծել զանգվածներ
    int arr1[n], arr2[n], product[n];

    // Մուտքագրել առաջին զանգվածի էլեմենտները
    printf("Մուտքագրեք առաջին զանգվածի %d էլեմենտները:\n", n);
    for (int i = 0; i < n; i++) {
        printf("arr1[%d]: ", i);
        scanf("%d", &arr1[i]);
    }

    // Մուտքագրել երկրորդ զանգվածի էլեմենտները
    printf("Մուտքագրեք երկրորդ զանգվածի %d էլեմենտները:\n", n);
    for (int i = 0; i < n; i++) {
        printf("arr2[%d]: ", i);
        scanf("%d", &arr2[i]);
    }

    // Հաշվել համապատասխանող էլեմենտների արտադրյալը
    for (int i = 0; i < n; i++) {
        product[i] = arr1[i] * arr2[i];
    }

    // Արտածել արդյունքը
    printf("Արտադրյալները՝ համապատասխանող ինդեքսներով:\n");
    for (int i = 0; i < n; i++) {
        printf("arr1[%d] * arr2[%d] = %d\n", i, i, product[i]);
    }

    return 0;
}

